# 是什么？
# http:是超文本传输协议，这个协议是一个应用层协议，基于底层tcp协议所造的一个协议
from unittest import result

# 为什么？
# 这个协议主要就是做前后端交互的规矩，前端发请求给后端，需要带什么东西，后端给前端返回什么东西，都需要遵循这个协议
# 报文：请求报文和响应报文
# 1、行  2、头  3空行 4、体 组成的一坨（字符串），我们一般看不见这个原始的报文信息，浏览器看到的也是浏览器整理之后的
# 如果要看到全部的完整原始报文，只能抓包。wireshark.
# 但是我们并不关注完整的报文，我们其实关注的是报文里面的部分信息罢了


# 怎么做
# 前端（搭页面）
#     一、1、发情求  2、拿数据  3、动态渲染  4、展示给用户
#     二、1、收集数据 2、发请求  3、数据传递给后端 4、后端把数据存库
#
# 请求方式
# 请求路径
# 请求参数（path query body）
# 状态码
# 响应数据
# 响应头（主要是给浏览器看的，浏览器会根据这些响应头决定不同的操作）
# 请求头（token）



# 后端（写接口）
#     一、接收请求报文
# 接收参数 三种参数
# 接收请求头
# 接收文件
#     二、返回响应报文
# 返回状态码
# #     100
#         正在请求中  一般看不到
# #     200
#         请求成功
# #     300
#         请求重定向
# #     400
#         前端有问题
# #     500
#         后端有问题


# 返回响应头
# 返回数据（json，文件、流）

# 不管是前端关注的还是后端关注的，框架本身就已经把接收的报文帮我们封装成对应的数据，我们只需要去根据api获取想要的数据即可，而不是让我们自己
# 去解析报文，再去获取数据。